const rawStr = `[id:$00000000]
[ar:鹿先森乐队]
[ti:春风十里]
[by:]
[hash:a21d08e024d1db392c0bcb9674268a1c]
[al:]
[sign:]
[qq:]
[total:376179]
[offset:0]
[00:00.00]鹿先森乐队 - 春风十里
[00:01.67]作词：郭倍倍
[00:02.88]作曲：郭倍倍
[00:03.99]编曲：鹿先森乐队
[00:22.74]我在二环路的里边想着你
[00:30.30]你在远方的山上春风十里
[00:37.18]今天的风吹向你下了雨
[00:44.52]我说所有的酒都不如你
[00:51.27]我在鼓楼的夜色中
[00:54.04]为你唱花香自来
[00:58.73]在别处沉默相遇和期待
[01:05.66]飞机飞过车水马龙的城市
[01:12.86]千里之外不离开
[01:19.36]把所有的春天都揉进了一个清晨
[01:26.51]把所有停不下的言语
[01:28.52]变成秘密关上了门
[01:34.06]莫名的情愫啊
[01:36.08]请问 谁来将它带走呢
[01:41.12]只好把岁月化成歌 留在山河
[02:16.47]我在鼓楼的夜色中
[02:19.54]为你唱花香自来
[02:24.03]在别处沉默相遇和期待
[02:30.94]飞机飞过车水马龙的城市
[02:38.18]千里之外不离开
[02:45.18]把所有的春天都揉进了一个清晨
[02:52.73]把所有停不下的言语
[02:54.90]变成秘密关上了门
[03:00.24]莫名的情愫啊
[03:02.16]请问 谁来将它带走呢
[03:07.40]只好把岁月化成歌 留在山河
[04:10.97]把所有的春天都揉进了一个清晨
[04:18.08]把所有停不下的言语
[04:20.04]变成秘密关上了门
[04:25.59]莫名的情愫啊
[04:27.46]请问 谁来将它带走呢
[04:32.70]只好把岁月化成歌 留在山河
[04:39.86]我在二环路的里边想着你
[04:47.41]你在远方的山上春风十里
[04:54.60]今天的风又吹向你下了雨
[05:02.27]我说所有的酒都不如你`

const str1 = rawStr.slice(rawStr.indexOf('[00:00.00]'), rawStr.length);

// console.log(str1);
/* 
  [00:00.00]鹿先森乐队 - 春风十里 
  [00:01.67]作词：郭倍倍
  [00:02.88]作曲：郭倍倍
  [00:03.99]编曲：鹿先森乐队      
  .................................
  ................................
  [04:47.41]你在远方的山上春风十里
  [04:54.60]今天的风又吹向你下了雨
  [05:02.27]我说所有的酒都不如你
*/
let lyric_arr = str1.split("\n");
console.log(lyric_arr[0]);
// [00:00.00]鹿先森乐队 - 春风十里