/* https://www.xzmp3.com/mp3/90434fa12574.htm */
const lyric = `[00:00.000] 作词 : 许含光/丁世光
[00:01.000] 作曲 : 丁世光
[00:02.000] 编曲 : 丁世光/程振兴
[00:26.40]从来不曾怀疑过 我见过
[00:33.21]最高的山峰 最温暖的手
[00:39.21]从前我不假思索 大胆蹉跎
[00:46.97]以为我会永垂不朽
[00:50.02]才发现 当我终于张开眼
[00:57.06]看见他们早就紧紧闭上
[01:03.74]Simon I just don't know
[01:08.90]该往哪里走
[01:11.95]盲目还麻木的走
[01:16.20]Simon 我还不明白
[01:23.43]为什么命运捉弄我
[01:26.23]降落在这个错误的星球
[01:44.32]自命不凡的赌徒 一掷孤注
[01:51.08]明知不能再输 却一直下注
[01:57.22]早已什么都没有
[02:00.43]我还不断频频回头
[02:04.14]等待那些我曾经失去
[02:06.48]和那些我即将要失去的
[02:10.24]是我太常哭红眼睛
[02:14.85]还是他们已经不会悲伤
[02:21.51]Simon I just don't know
[02:26.74]该往哪里走 盲目还麻木的走
[02:33.84]Dear simon 我还不明白
[02:40.82]什么时候我们才能够
[02:44.10]逃离这星球 我们能吗
[02:49.00]我一直记得 你说你永远相信我
[02:55.37]现在我很难过
[02:57.06]恐怕我找不回那个自我
[03:09.01]I just don't know
[03:12.10]该往哪里走 我才算真的活过
[03:19.47]Simon 我还不明白
[03:26.23]还能按照我们原来的期待
[03:30.08]去证明我们的未来吗
[03:39.31]My dear simon
[04:01.61]Hey I just don't know
[04:04.23]该往哪里走
[04:07.48]反正都麻木的走
[04:12.24]Hey 怎么停下来
[03:53.94]......
[04:44.43]制作人:丁世光/程振兴/叶喜儿
[04:54.39]编曲:丁世光 /程振兴
[05:03.30]电钢琴:丁世光
[05:13.57]鼓/打击乐 :Tamir Barzilay
[05:20.57]贝斯: 程振兴
[05:30.57]吉他 : 程振兴
[05:40.57]和声 : 叶喜儿/丁世光
[05:50.57]弦乐编写: 程振兴
[06:00.57]弦乐指挥 : Nikolo Kotzev
[06:05.57]弦乐 : Sofia Session Orchestra (Bulgaria)
[06:10.57]录音工程 : Plamen Penchev
[06:15.57]录音室 : Barzilay Studio (LA)/Sofia Session Studio (SOF) / 伟大文化录音室(BJ)
[06:20.57]混音工程师:赵靖 at BIG.J Studio (BJ)
[06:25.57]母带后期处理工程师:Gene Grimaldi at Oasis Mastering (LA)`;
